HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
#ifdef DEBUG_LOG_RTT									
		SEGGER_RTT_printf(0, "adc:%4d,%4d,%4d,%4d \r\n",(uint16_t)adc_sample[0],(uint16_t)adc_sample[1],(uint16_t)adc_sample[2],(uint16_t)adc_sample[3]);		
#endif		
}	
	
/**
 * @brief ADC initialization.
 */
void adc_config(void)
{
    const nrf_adc_config_t nrf_adc_config = NRF_ADC_CONFIG_DEFAULT;

    // Initialize and configure ADC
    nrf_adc_configure( (nrf_adc_config_t *)&nrf_adc_config);
//    nrf_adc_input_select(NRF_ADC_CONFIG_INPUT_4);
//    nrf_adc_int_enable(ADC_INTENSET_END_Enabled << ADC_INTENSET_END_Pos);
//    NVIC_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_HIGH);
//    NVIC_EnableIRQ(ADC_IRQn);
}

void pwm_ready_callback(uint32_t pwm_id)    // PWM callback function
{
    ready_flag = true;
}

void leds_on_for_while(void)
{
	nrf_delay_ms(1500);
	nrf_gpio_pin_clear(BSP_LED_0);
	nrf_gpio_pin_set(BSP_LED_1);
	nrf_gpio_pin_clear(BSP_LED_2);
	nrf_gpio_pin_clear(BSP_LED_3);
}

void relay_on(void)
{
	nrf_gpio_pin_clear(RELAY_OFF);
	nrf_gpio_pin_set(RELAY_ON);
}
void relay_off(void)
{
	nrf_gpio_pin_clear(RELAY_ON);
	nrf_gpio_pin_set(RELAY_OFF);
}
void relay_idle(void)
{
	nrf_gpio_pin_clear(RELAY_ON);
	nrf_gpio_pin_clear(RELAY_OFF);
}

void led_communicate_blink(e_event led_event_type)
{
	//UNUSED_PARAMETER(led_event_type);
	update_led_event(led_event_type);
	
	nrf_gpio_pin_clear(BSP_LED_1);
	uint32_t err_code = app_timer_start(m_communicate_timer_id, COMMUNICATE_INTERVAL, NULL);
	APP_ERROR_CHECK(err_code);	
}
void motion_sound_event_set(e_event led_event_type)
{
	update_led_event(led_event_type);
	nrf_gpio_pin_clear(BSP_LED_1);	
	
	uint32_t err_code = app_timer_start(m_motion_sound_timer_id, MOTION_SOUND_INTERVAL, NULL);
	APP_ERROR_CHECK(err_code);	
		
}




void update_led_event(e_event led_event_type)
{
	led_event.status = true ;	//led bright on first.
	
	if(led_event_type == SOUND_EVENT) 
	{
		led_event.event_type = SOUND_EVENT; 
		led_event.off_time = SOUND_EVENT_OFF;
		led_event.on_time = SOUND_EVENT_ON;		
	}else if (led_event_type == MOTION_EVENT)
	{
		led_event.event_type = MOTION_EVENT; 
		led_event.off_time = MOTION_EVENT_OFF;
		led_event.on_time = MOTION_EVENT_ON;					
	}else if(led_event_type == HEARTBEAT_EVENT)  
	{
		led_event.event_type = HEARTBEAT_EVENT;
		led_event.off_time = HEARTBEAT_EVENT_OFF;
		led_event.on_time = HEARTBEAT_EVENT_ON;					
	}else if(led_event_type == COMMUNICATE_EVENT)  
	{
		led_event.event_type = COMMUNICATE_EVENT;
		led_event.off_time = HEARTBEAT_EVENT_OFF;
		led_event.on_time = HEARTBEAT_EVENT_ON;					
	}
	
}

/**@brief Function for handling the led blink timer timeout.
 *
 * @details This function will be called each time the led blink timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void led_heartbeat_handler(void * p_context)
{
    //UNUSED_PARAMETER(p_context);		
	nrf_drv_wdt_channel_feed(m_channel_id);	//feed the dog
	
	if((led_event.event_type == SOUND_EVENT) || (led_event.event_type == MOTION_EVENT))
	{

	}else if(led_event.event_type == COMMUNICATE_EVENT)
	{
		
	}else if(led_event.event_type == HEARTBEAT_EVENT)
	{
		if(led_event.status)
		{
			if(!led_event.on_time--)
			{					
				nrf_gpio_pin_set(BSP_LED_1);
				led_event.status = false;
				led_event.off_time = (uint16_t)HEARTBEAT_EVENT_OFF; 
				led_event.on_time = (uint16_t)HEARTBEAT_EVENT_ON; 
			}			
		}else
		{
			if(!led_event.off_time--)
			{			
				nrf_gpio_pin_clear(BSP_LED_1);
				led_event.status = true;
				led_event.on_time = (uint16_t)HEARTBEAT_EVENT_ON;
				led_event.off_time = (uint16_t)HEARTBEAT_EVENT_OFF; 		
			}			
		}

//#ifdef DEBUG_LOG_RTT
//		SEGGER_RTT_printf(0, "status:%2d,ON%2d,OFF%2d,\r\n",led_event.status,
//															(uint16_t)led_event.on_time,
//															(uint16_t)led_event.off_time);
//#endif
		
	}else if(led_event.event_type == FIRMWAREUPDATE_EVENT)
	{
		
	}else
	{
		
	}
		
}


/**@brief Function for handling the relay execute timer timeout.
 *
 * @details This function will be called each time relay execute timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void relay_execute_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);		
    relay_idle();	
	
}

/**@brief Function for handling the led communicate timer timeout.
 *
 * @details This function will be called each led communicate execute timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void led_off_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);		
    nrf_gpio_pin_set(BSP_LED_1);	
	//update_led_event(HEARTBEAT_EVENT);
	
	led_event.status = false;
	led_event.event_type = HEARTBEAT_EVENT;
	led_event.off_time = HEARTBEAT_EVENT_OFF - 25;			//queick start heartbeat settings
	led_event.on_time = HEARTBEAT_EVENT_ON;	
	
}
/**@brief Function for handling the pwm update timer timeout.
 *
 * @details This function will be called each pem update timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void pwm_update_handler(void * p_context)
{
    uint8_t	i;
	uint32_t	value ;
	
	UNUSED_PARAMETER(p_context);	
	
	for ( i = 0; i < 40; ++i)
	{
		value = (i < 20) ? (i * 5) : (100 - (i - 20) * 5);
		
		ready_flag = false;
		/* Set the duty cycle - keep trying until PWM is ready... */
        while (app_pwm_channel_duty_set(&PWM1, 0, value) == NRF_ERROR_BUSY);
        while (app_pwm_channel_duty_set(&PWM1, 1, value) == NRF_ERROR_BUSY);
		
		/* ... or wait for callback. */
//		while(!ready_flag);
//		APP_ERROR_CHECK(app_pwm_channel_duty_set(&PWM1, 1, value));
		
#ifdef DEBUG_LOG_RTT
			SEGGER_RTT_printf(0, "pwm_update %d,%d.\r\n",(uint8_t)i,(uint16_t)value);
#endif			
		
