HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
	}
			
}

/**@brief Function for handling the PIR update timer timeout.
 *
 * @details This function will be called each PIR update timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void pir_event_handler(void * p_context)
{
//	int8_t slop;
	
	UNUSED_PARAMETER(p_context);	
	PIR_Buffer[0] = PIR_Buffer[1];
	
	PIR_Buffer[1] = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_4);	
	
	if(PIR_Buffer[1] < 300) 
	{
		update_led_event(MOTION_EVENT);
		motion_sound_event_set(MOTION_EVENT);
		
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "MOTION_EVENT\r\n");															
#endif		
	}
		
}
/**@brief Function for handling the sound event timer timeout.
 *
 * @details This function will be called each sound event timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sound_event_handler(void * p_context)
{
	
	UNUSED_PARAMETER(p_context);	
	
	sound_sample = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_2);	
	
	if(sound_sample > 200) 
	{
		update_led_event(SOUND_EVENT);
		motion_sound_event_set(SOUND_EVENT);
		
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "SOUND_EVENT\r\n");															
#endif		
	}
		
}

/**
* @brief General error handler.
*/
static void error_loop(void)
{
    led_config(0, 1);
    led_config(1, 1);		// led1
    led_config(2, 1);
    led_config(3, 1);
    
    __disable_irq(); /* Prevent the mesh from continuing operation. */
    while (true)
    {
        __WFE(); /* sleep */
    }
}
/**
* @brief Softdevice crash handler, never returns
*
* @param[in] pc Program counter at which the assert failed
* @param[in] line_num Line where the error check failed
* @param[in] p_file_name File where the error check failed
*/
void sd_assert_handler(uint32_t pc, uint16_t line_num, const uint8_t* p_file_name)
{
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "sd_assert_handler.\r\n  ");
#endif    
	error_loop();
}

/**
* @brief App error handle callback. Called whenever an APP_ERROR_CHECK() fails.
*   Never returns.
*
* @param[in] error_code The error code sent to APP_ERROR_CHECK()
* @param[in] line_num Line where the error check failed
* @param[in] p_file_name File where the error check failed
*/
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "app_error_handler.\r\n  ");
#endif    
	error_loop();
}

/** @brief Hardware fault handler. */
void HardFault_Handler(void)
{
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "HardFault_Handler.\r\n  ");
#endif    
	error_loop();
}

void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "app_error_fault_handler.\r\n  ");
#endif
    error_loop();
}
/**
* @brief Softdevice event handler
*/
void sd_ble_evt_handler(ble_evt_t* p_ble_evt)
{
    rbc_mesh_ble_evt_handler(p_ble_evt);
    nrf_adv_conn_evt_handler(p_ble_evt);
}

/**
* @brief RBC_MESH framework event handler. Defined in rbc_mesh.h. Handles
*   events coming from the mesh. Sets LEDs according to data
*
* @param[in] evt RBC event propagated from framework
*/
static void rbc_mesh_event_handler(rbc_mesh_event_t* p_evt)
{   
    switch (p_evt->type)
    {
        case RBC_MESH_EVENT_TYPE_CONFLICTING_VAL:
        case RBC_MESH_EVENT_TYPE_NEW_VAL:
        case RBC_MESH_EVENT_TYPE_UPDATE_VAL:
            if (p_evt->params.rx.value_handle > 1)
                break;

            //led_config(p_evt->params.rx.value_handle, p_evt->params.rx.p_data[0]);
            break;
        case RBC_MESH_EVENT_TYPE_TX:
            break;

        case RBC_MESH_EVENT_TYPE_INITIALIZED:
            /* init BLE gateway softdevice application: */
            nrf_adv_conn_init();
            break;
#ifdef MESH_DFU
        case RBC_MESH_EVENT_TYPE_DFU_BANK_AVAILABLE:
            dfu_bank_flash(p_evt->params.dfu.bank.dfu_type);
            break;

        case RBC_MESH_EVENT_TYPE_DFU_NEW_FW_AVAILABLE:
            dfu_request(p_evt->params.dfu.new_fw.dfu_type,
                &p_evt->params.dfu.new_fw.new_fwid,
                (uint32_t*) EXAMPLE_DFU_BANK_ADDR);
            break;

        case RBC_MESH_EVENT_TYPE_DFU_RELAY_REQ:
            dfu_relay(p_evt->params.dfu.relay_req.dfu_type,
                &p_evt->params.dfu.relay_req.fwid);
            break;

        case RBC_MESH_EVENT_TYPE_DFU_START:
        case RBC_MESH_EVENT_TYPE_DFU_END:
            break;
        case RBC_MESH_EVENT_TYPE_DFU_SOURCE_REQ:
            break;
#endif
        default:
            break;
    }
}


/**
* @brief Initialize GPIO pins, for LEDs and debugging
*/
void gpio_init(void)
{
    nrf_gpio_range_cfg_output(LED_START, LED_STOP);

    for (uint32_t i = 0; i < LEDS_NUMBER; ++i)
    {
        nrf_gpio_pin_set(LED_START + i);
    }	
	nrf_gpio_pin_clear(BSP_LED_1);	// LOW LEVEL LED1 ON
	
#if defined(BOARD_LIGHTSWITCH)			
	nrf_gpio_cfg_output(RELAY_OFF);
	nrf_gpio_pin_clear(RELAY_OFF);
	nrf_gpio_cfg_output(RELAY_ON);
	nrf_gpio_pin_clear(RELAY_ON);	
	nrf_gpio_cfg_output(RELAY2_ON);	
	nrf_gpio_pin_clear(RELAY2_ON);
	nrf_gpio_cfg_output(RELAY2_OFF);	
	nrf_gpio_pin_clear(RELAY2_OFF);	
    nrf_gpio_cfg_output(IR_SEND);
	nrf_gpio_pin_clear(IR_SEND);
	nrf_gpio_cfg_input(IR_REC,NRF_GPIO_PIN_PULLUP);		
#endif

#if defined(BOARD_PCA10028) || defined(BOARD_PCA10040)
    #ifdef BUTTONS
        nrf_gpio_cfg_input(BUTTON_1, NRF_GPIO_PIN_PULLUP);
        nrf_gpio_cfg_input(BUTTON_2, NRF_GPIO_PIN_PULLUP);
        nrf_gpio_cfg_input(BUTTON_3, NRF_GPIO_PIN_PULLUP);
        nrf_gpio_cfg_input(BUTTON_4, NRF_GPIO_PIN_PULLUP);
    #endif
#endif

}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_KEY_0:
//		nrf_gpio_pin_toggle(BSP_LED_0);
//		nrf_gpio_pin_toggle(BSP_LED_2);						
//		if(relay_status)
//		{
//			relay_off();			
//			relay_status = 0;
//			err_code = app_timer_start(m_relay_timer_id, RELAY_INTERVAL, NULL);
//			APP_ERROR_CHECK(err_code);
//						
//		}else
//		{
//			relay_on();			
//			relay_status = 1;
//			err_code = app_timer_start(m_relay_timer_id, RELAY_INTERVAL, NULL);
//			APP_ERROR_CHECK(err_code);				
//		}		
//        break;		
		 nrf_adc_start();
		
